[Killed] BlockStatement
Validação e Verificação de Software/software-testing/triangle-mutation-test/triangle.js:3:32
 class triangle {
     // sets as 0 in case no value is given
-    constructor(a=0, b=0, c=0) {
-        this.a = a
-        this.b = b
-        this.c = c
-    }
+    constructor(a=0, b=0, c=0) {}
 
     // returns the triangle type according to the sides given

[Killed] BlockStatement
Validação e Verificação de Software/software-testing/triangle-mutation-test/triangle.js:10:16
     }
 
     // returns the triangle type according to the sides given
-    classify() {
-        return  (this.a <= 0 || this.b <= 0 || this.c <= 0) && 'invalid' ||
-                (this.a === this.b && this.a === this.c) && 'equilateral' ||
-                (this.a === this.b || this.a === this.c || this.b === this.c) && 'isosceles' ||
-                'scalene'
-    }
+    classify() {}
 }
 

[Killed] ConditionalExpression
Validação e Verificação de Software/software-testing/triangle-mutation-test/triangle.js:11:48
 
     // returns the triangle type according to the sides given
     classify() {
-        return  (this.a <= 0 || this.b <= 0 || this.c <= 0) && 'invalid' ||
+        return  (this.a <= 0 || this.b <= 0 || true) && 'invalid' ||
                 (this.a === this.b && this.a === this.c) && 'equilateral' ||
                 (this.a === this.b || this.a === this.c || this.b === this.c) && 'isosceles' ||

[Killed] LogicalOperator
Validação e Verificação de Software/software-testing/triangle-mutation-test/triangle.js:11:18
 
     // returns the triangle type according to the sides given
     classify() {
-        return  (this.a <= 0 || this.b <= 0 || this.c <= 0) && 'invalid' ||
+        return  (this.a <= 0 && this.b <= 0 || this.c <= 0) && 'invalid' ||
                 (this.a === this.b && this.a === this.c) && 'equilateral' ||
                 (this.a === this.b || this.a === this.c || this.b === this.c) && 'isosceles' ||

[Killed] LogicalOperator
Validação e Verificação de Software/software-testing/triangle-mutation-test/triangle.js:12:17
     // returns the triangle type according to the sides given
     classify() {
         return  (this.a <= 0 || this.b <= 0 || this.c <= 0) && 'invalid' ||
-                (this.a === this.b && this.a === this.c) && 'equilateral' ||
+                this.a === this.b && this.a === this.c || 'equilateral' ||
                 (this.a === this.b || this.a === this.c || this.b === this.c) && 'isosceles' ||
                 'scalene'

[Killed] LogicalOperator
Validação e Verificação de Software/software-testing/triangle-mutation-test/triangle.js:12:18
     // returns the triangle type according to the sides given
     classify() {
         return  (this.a <= 0 || this.b <= 0 || this.c <= 0) && 'invalid' ||
-                (this.a === this.b && this.a === this.c) && 'equilateral' ||
+                (this.a === this.b || this.a === this.c) && 'equilateral' ||
                 (this.a === this.b || this.a === this.c || this.b === this.c) && 'isosceles' ||
                 'scalene'

[Killed] LogicalOperator
Validação e Verificação de Software/software-testing/triangle-mutation-test/triangle.js:13:18
     classify() {
         return  (this.a <= 0 || this.b <= 0 || this.c <= 0) && 'invalid' ||
                 (this.a === this.b && this.a === this.c) && 'equilateral' ||
-                (this.a === this.b || this.a === this.c || this.b === this.c) && 'isosceles' ||
+                ((this.a === this.b || this.a === this.c) && this.b === this.c) && 'isosceles' ||
                 'scalene'
     }

[Killed] EqualityOperator
Validação e Verificação de Software/software-testing/triangle-mutation-test/triangle.js:13:18
     classify() {
         return  (this.a <= 0 || this.b <= 0 || this.c <= 0) && 'invalid' ||
                 (this.a === this.b && this.a === this.c) && 'equilateral' ||
-                (this.a === this.b || this.a === this.c || this.b === this.c) && 'isosceles' ||
+                (this.a !== this.b || this.a === this.c || this.b === this.c) && 'isosceles' ||
                 'scalene'
     }
